{
  "Home": "الرئيسية",
  "About Us": "عنا",
  "Research": "أبحاثنا",
  "Products": "منتجاتنا",
  "Contact us": "اتصل بنا",
  "Research and development": "البحث والتطوير",
  "Mr. Mohamed Fathy": "م/ محمد فتحي",
  "Eng. Nora Ragheb": "م/ نورا راغب",
  "114 Sakr Qurish Budling Behind Al Tabari School, Third Floor, No. 15. Sheraton, Cairo, Egypt.": "١١٤ صقر قريش خلف مدرسة الطبراوي، الدور الثالث، شقة ١٥، شيراتون، القاهرة،مصر",
  "Globagen Research and Development Contracting Services! We are a leading provider of specialized services in the field of molecular biology in Egypt. With our expertise and advanced technology, we offer a wide range of solutions in various areas such as pathogen detection, crop variety identification, antibody development, and nanobody research to worldwide customers.": "مرحبا بك في خدمات غلوباجين للبحث والتطوير التعاقدية! تقدم جلوباجين خدمات متخصصة في مجال الأحياء الجزيئية، ونشمل مجموعة واسعة من الحلول في مجالات مثل اكتشاف الطفيليات الممرضة للنبات والحيوانات الزراعية، وتحديد أصناف النباتات، وتطوير الأجسام المضادة والنانوبوديز وغيرها..  في غلوباجين، ندرك أهمية النتائج الدقيقة والموثوقة في مجال الأحياء.",
  "At Globagen, we understand the importance of accurate and timely results in molecular biology research and development. That's why we have assembled a team of highly skilled scientists and technicians who are dedicated to delivering exceptional services tailored to your specific needs. Our state-of-the-art facilities and cutting-edge equipment ensure that we stay at the forefront of molecular biology advancements.": "نحن نتفهم أهمية الحصول على نتائج دقيقة وفي الوقت المناسب في أبحاث وتطوير البيولوجيا الجزيئية. لهذا السبب قمنا بتجميع فريق من العلماء والفنيين ذوي المهارات العالية الذين يكرسون جهودهم لتقديم خدمات استثنائية مصممة وفقًا لاحتياجاتك الخاصة. تضمن مرافقنا الحديثة ومعداتنا المتطورة أن نظل في طليعة التطورات في مجال البيولوجيا الجزيئية.",
  "One of our key focus areas is pathogen detection. We employ advanced molecular techniques to identify and analyze pathogens, helping you to effectively monitor and manage disease outbreaks. Whether it's viral, bacterial, or fungal pathogens, our expertise allows us to provide accurate and reliable results.": "أحد مجالات تركيزنا الرئيسية هو اكتشاف العوامل الممرضة. نحن نستخدم تقنيات جزيئية متقدمة لتحديد العوامل الممرضة وتحليلها ، مما يساعدك على مراقبة تفشي الأمراض وإدارتها بشكل فعال. سواء كانت مسببات الأمراض الفيروسية أو البكتيرية أو الفطرية ، تتيح لنا خبرتنا تقديم نتائج دقيقة وموثوقة.",
  "In addition, we specialize in crop variety identification. Through DNA-based techniques, we can accurately determine the genetic makeup of crops, enabling you to identify and select the most suitable varieties for your specific agricultural needs.": "بالإضافة إلى ذلك ، نحن متخصصون في تحديد أنواع المحاصيل. من خلال التقنيات القائمة على الحمض النووي ، يمكننا تحديد التركيب الجيني للمحاصيل بدقة ، مما يتيح لك تحديد واختيار الأصناف الأكثر ملاءمة لاحتياجاتك الزراعية الخاصة.",
  "Furthermore, our services extend to the development of antibodies and nanobodies. With our expertise in molecular biology and protein engineering, we can assist you in generating high-quality antibodies and nanobodies for various applications, including diagnostics, therapeutics, and research.": "علاوة على ذلك ، تمتد خدماتنا لتشمل تطوير الأجسام المضادة والأجسام النانوية. من خلال خبرتنا في البيولوجيا الجزيئية وهندسة البروتين ، يمكننا مساعدتك في إنتاج أجسام مضادة عالية الجودة وأجسام نانوية لمختلف التطبيقات ، بما في ذلك التشخيص والعلاجات والأبحاث.",
  "We take pride in our commitment to quality, precision, and customer satisfaction. Our team works closely with you to understand your project goals and deliver results that meet your expectations. Whether you are an academic institution, a biotechnology company, or a research organization, we are here to support your molecular biology endeavors.": "نحن نفخر بالتزامنا بالجودة والدقة ورضا العملاء. يعمل فريقنا معك عن كثب لفهم أهداف مشروعك وتقديم النتائج التي تلبي توقعاتك. سواء كنت مؤسسة أكاديمية أو شركة تكنولوجيا حيوية أو مؤسسة بحثية ، نحن هنا لدعم مساعيك في مجال البيولوجيا الجزيئية. ",
  "Explore the possibilities with Globagen Research and Development Contracting Services and let us help you advance your molecular biology projects. Contact us today to discuss your specific requirements and learn more about our comprehensive range of services.": "استكشف الاحتمالات مع Globagen Research and Development Contract Services ودعنا نساعدك على تطوير مشاريع البيولوجيا الجزيئية الخاصة بك. اتصل بنا اليوم لمناقشة متطلباتك الخاصة ومعرفة المزيد حول مجموعة خدماتنا الشاملة.",
  "Together, we can unlock the potential of molecular biology and drive innovation in various fields.": "معًا ، يمكننا إطلاق إمكانات البيولوجيا الجزيئية ودفع الابتكار في مختلف المجالات.",
  "Welcome to the world of Globagen!": "مرحبًا بكم في عالم جلوباجين !"
}
